Repository: gitter-badger/portabase
Catalog: resources/help/translations/*/image_editor.po
Languages: fr, ja

source: Image editor
fr: Editeur d'images
ja: 画像編集画面

source: An Image column stores pictures imported from JPEG or PNG image files. After you select an image file to import into a field in the database, this dialog is shown so you can make minor changes to the copy of the image that will be saved in the database. The top row contains the following controls:
fr: Une colonne de type Image stocke des images importées à partir de fichier au format JPEG ou PNG. Après avoir sélectionné un fichier à importer dans un champ de la base de données, cette boite de dialogue est affichée, ainsi vous pouvez apporter des modifications mineures sur la copie de l'image qui sera enregistrée dans la base de données. La ligne du haut contient les contrôles suivants :
ja: 画像フィールドにはJPEGまたはPNG画像ファイルから読み込んだ写真が保持されます。データベース上のフィールドにインポートする画像ファイルを選択すると、この画面が表示され、データベースに保持する画像のコピーにちょっとした変更を加えることができます。画面上部には以下のコントロールがあります:

source: **Width**
fr: **Largeur**
ja: **幅**

source: The maximum allowed width of the image (in pixels).
fr: La largeur maximale autorisée pour l'image (en pixels).
ja: 画像の幅の上限値（ピクセル単位)。

source: **Height**
fr: **Hauteur**
ja: **高さ**

source: The maximum allowed height of the image (in pixels).
fr: La hauteur maximale autorisée pour l'image (en pixels).
ja: 画像の幅の上限値（ピクセル単位)。

source: **Rotate**
fr: **Rotation**
ja: **回転**

source: The angle by which to rotate the image (in degrees): 0, 90, 180, or 270.
fr: L'angle de rotation de l'image (en degrés) : 0, 90, 180 ou 270.
ja: 画像を回転させる角度: 0、90、180、270のいずれか。

source: **Refresh**
fr: **Actualiser**
ja: **再読み込み**

source: Apply the currently displayed settings and update the image preview accordingly.
fr: Applique la configuration d'affichage actuelle et met à jour la prévisualisation de l'image en conséquence.
ja: 現在表示されている設定を適用し、画像プレビューを更新します。

source: Click "OK"/"Done" to store the image as it is shown, or cancel out of the dialog to leave the field unchanged.
fr: Cliquez sur "OK"/"Fait" pour stocker l'image telle qu'elle est affichée ou quittez la boite de dialogue en annulant pour laisser le champ non modifié.
ja: "OK"を押して表示されている状態で画像を保存するか、あるいはキャンセルして変更せずに終了します。

source: Because memory was limited on the Zaurus PDAs for which PortaBase was originally developed, very large pictures will be rejected. JPEG images larger than 6400 x 4800 pixels cannot be imported, and ones larger than 800 x 600 will be shrunk to at most that size. Similarly, PNG images larger than 800 x 600 cannot be imported. These limitations will be removed in a future version of PortaBase, since it is no longer being developed for the Zaurus.
fr: Parce que la mémoire était limitée sur les Zaurus, ordinateurs personnels pour lesquels PortaBase a été initialement développé, les images de très grande taille ne sont pas supportées. Les images JPEG supérieures à 6400 x 4800 pixels ne peuvent être importées et celles supérieures à 800 x 600 seront réduites à cette taille maxi. De même, les images PNG supérieures à 800 x 600 ne peuvent être importées. Ces limitations seront supprimées dans une version future de PortaBase puisque que le développement pour le Zaurus a été arrêté.
ja: PortaBase開発の元だったザウルス上のメモリが限られていたことから、大きすぎる画像は弾かれます。JPEG画像では6,400×4,800ピクセルを超えるものはインポートできませんし、800×600以上のものは最大でもこのサイズに縮小されます。同様に、PNG画像では800×600ピクセル以上のものはインポートできません。PortaBaseのZaurus版が開発中止になったので、この制限は近い内になくなります。
